docs/comp-sci/theorem-provers/small.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-11-20 Sat 19:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>On Kernel Size</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">On Kernel Size</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-bb3c318e-1f27-4cde-a517-2b476e0b15b8">1. Observations</a></li>
</ul>
</div>
</div>
<p>
<b>Puzzle:</b> How small should a proof assistant's kernel be, for it to be
 considered "bug free"?
</p>

<p>
<b>Solution:</b> Use the <a href="https://en.wikipedia.org/wiki/Negative_binomial_distribution">Negative Bernoulli distribution</a> for \(r\) bugs, the
probability of a line of code being bug free is \(p\), and the probability
of a bug is \(q\approx 20/1000\) (which is the currently accepted rate,
informally used among programmers), and <a href="https://en.wikipedia.org/wiki/Chebyshev%27s_inequality">Chebyshev's inequality</a> to
estimate the number of bugs \(r\) within \(3\sigma\) of zero. Recall
\(\mu=pr/q\) is the mean for the distribution, and \(\sigma^{2}=pr/q^{2}\)
is the variance. Then Chebyshev gives us, for tolerance of \(k\sigma\):
</p>

\begin{equation}
\mu < k\sigma\implies \frac{p}{q}r < \frac{k}{q}\sqrt{pr}.
\end{equation}

<p>
We solve for \(r\):
</p>

\begin{equation}
r < \frac{k^{2}}{p}.
\end{equation}

<p>
Then we find the expected number of lines of code should be
</p>

\begin{equation}
\mu \approx\frac{k^{2}}{q}.
\end{equation}

<p>
For the figures given, we have
</p>

\begin{equation}
\mu = 441.
\end{equation}

<p>
Thus the upper-bound on a program to be a candidate for being "bug free"
is approximately 441 lines of code.
</p>

<div id="outline-container-h-bb3c318e-1f27-4cde-a517-2b476e0b15b8" class="outline-2">
<h2 id="h-bb3c318e-1f27-4cde-a517-2b476e0b15b8"><span class="section-number-2">1.</span> Observations</h2>
<div class="outline-text-2" id="text-h-bb3c318e-1f27-4cde-a517-2b476e0b15b8">
<p>
If we use a <a href="https://en.wikipedia.org/wiki/Binomial_distribution">Binomial distributed</a> random variable
\(B\sim\mathrm{Bin}(N,p_{bug})\), and look at finding the greatest number
of lines of code \(N\) such that the probability of finding no more than
\(3\sigma\) bugs is \(\Pr(B\leq 3\sigma)\geq 0.5\), then we find \(N\approx 533\).
The R code which let me solve this by brute force:
</p>

<div class="org-src-container">
<pre class="src src-r">p_bug &lt;- 0.02
q_bug &lt;- 1 - p_bug

sd_bug &lt;- sqrt(p_bug*q_bug) # sigma = sd_bug*sqrt(n)

# `guess` computes the likelihood L(n) = Pr(B &lt;= 3*sigma | n)
# of no more than `3*sigma` bugs. We are trying to find the greatest
# `n` such that `guess(n) &gt;= 0.5`; empirically this seems to be
# 533, and fluctuates around a decreasing trend.
guess &lt;- function(n) { pbinom(round(3*sd_bug*sqrt(n)), n, p_bug)}

guess(441)
# [1] 0.6113548
guess(533)
# [1] 0.5002271
</pre>
</div>

<p>
This <code>guess</code> is not a monotonic function, but 533 seems to be the
greatest value of <code>n</code> such that <code>guess(n) &gt;= 0.5</code>.
</p>

<p>
If we wanted to be more certain, we could modify the code:
</p>

<div class="org-src-container">
<pre class="src src-r">guess &lt;- function(n, k=3) { pbinom(round(k*sd_bug*sqrt(n)), n, p_bug)}
guess(1283, k=5) # expected bugs: 25.66
# [1] 0.5000607
guess(883, k=4) # expected bugs: 17.66
# [1] 0.5001064
guess(533, k=3) # expected bugs: 10.66
# [1] 0.5002271
guess(283, k=2) # expected bugs: 5.66
# [1] 0.5005881
guess(133, k=1) # expected bugs: 2.66
# [1] 0.5018235
</pre>
</div>

<p>
The moral: the fewer lines of code, the better.</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-11-20 Sat 19:14.</p>
</div>
</body>
</html>